a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/BOOT/driver/src/hc32f4a0_usb_core_driver.c
/**
 *******************************************************************************
 * @file  hc32f4a0_usb_core_driver.c
 * @brief USB core driver
 @verbatim
   Change Logs:
   Date             Author          Notes
   2021-03-29       Linsq           First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include <stdio.h>
#include "hc32f4a0_usb_core_driver.h"
#include "usb_bsp.h"

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief  core soft reset
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_coresoftrst(usb_core_instance *pdev)
{
    __IO  uint8_t  tmp_status;
    __IO  uint32_t tmp_grstctl;
    __IO  uint32_t tmp_count;

    tmp_status  = HD_USB_OK;
    tmp_grstctl = 0;
    tmp_count   = 0;
    /* Wait for AHB master to be idle. */
    do{
        hd_usb_udelay(1ul);
        tmp_grstctl = HD_USB_RDREG32(&pdev->regs.GREGS->GRSTCTL);
        if(++tmp_count > 100000ul)
        {
            tmp_status = HD_USB_ERROR;
        }
    }while(tmp_grstctl == 0);

    if(HD_USB_OK == tmp_status)
    {
        // Write the Core Soft Reset bit to reset the USB core
        tmp_count     = 0ul;
        tmp_grstctl  |= 1ul;
        HD_USB_WRREG32(&pdev->regs.GREGS->GRSTCTL, tmp_grstctl);
        // Waite for the reset finishing
        do{
            tmp_grstctl = HD_USB_RDREG32(&pdev->regs.GREGS->GRSTCTL);
            if(tmp_count > 100000ul)
            {
              break;
            }
            tmp_count++;
            hd_usb_udelay(1ul);
        }while(tmp_grstctl & 1ul);
        // Wait for at least 3 PHY clocks after the core resets
        hd_usb_udelay(3ul);
    }
}

/**
 *******************************************************************************
 ** \brief  Writes a packet whose byte number is len into the Tx FIFO associated
 **         with the EP
 ** \param  pdev : device instance
 ** \param  src : source pointer used to hold the transmited data
 ** \param  ch_ep_num : end point index
 ** \param  len : length in bytes
 ** \retval none
 ******************************************************************************/
void hd_usb_wrpkt(usb_core_instance *pdev, uint8_t *src, uint8_t ch_ep_num, uint16_t len)
{
    __IO uint32_t u32pAdr;
    __IO uint32_t *fifo;
    uint32_t tmp_count32b;
    uint32_t tmp_1;
    if (pdev->basic_cfgs.dmaen == 0u)
    {
        tmp_count32b = 0ul;
        tmp_1        = 0;
        tmp_count32b = (len + 3);
        tmp_count32b = tmp_count32b>>2;
        fifo = pdev->regs.DFIFO[ch_ep_num];
        tmp_1 = 0;
        while(tmp_1 < tmp_count32b)
        {
            HD_USB_WRREG32( fifo, *((uint32_t *)src) );
            u32pAdr  = (uint32_t)src;
            src      = (uint8_t*)(u32pAdr+4);
            tmp_1++;
        }
    }
}

/**
 *******************************************************************************
 ** \brief  Reads a packet whose byte number is len from the Rx FIFO
 ** \param  pdev : device instance
 ** \param  dest : destination pointer that point to the received data
 ** \param  len  : number of bytes
 ** \retval none
 ******************************************************************************/
void hd_usb_rdpkt(usb_core_instance *pdev, uint8_t *dest, uint16_t len)
{
    uint32_t tmp_1;
    __IO uint32_t tmp_count32b;
    __IO uint32_t u32pAdr;

    __IO uint32_t *fifo = pdev->regs.DFIFO[0];
    tmp_count32b            = (len + 3);
    tmp_count32b            = tmp_count32b>>2;
    u32pAdr                 = 0u;
    tmp_1                   = 0;
    while(tmp_1 < tmp_count32b)
    {
        *(uint32_t *)dest = HD_USB_RDREG32(fifo);
        u32pAdr           = (uint32_t)dest;
        dest              = (uint8_t*)(u32pAdr + 4);
        tmp_1++;
    }
}

/**
 *******************************************************************************
 ** \brief  Initialize the addresses of the core registers.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_setregaddr(usb_core_instance *pdev)
{
    uint32_t tmp_1, tmp_baseAddress;

    pdev->basic_cfgs.dmaen         = 0;
    tmp_baseAddress                = 0;
    /* initialize device cfg following its address */

    pdev->basic_cfgs.host_chnum    = 16u;
    pdev->basic_cfgs.dev_epnum     = 16u;
    pdev->basic_cfgs.core_type     = 0;   //FS
    pdev->basic_cfgs.phy_type      = 0;
#ifdef USB_FS_MODE
    tmp_baseAddress                = 0x40080000UL;
    pdev->basic_cfgs.core_type     = 0;   //FS
#endif //USB_FS_MODE

#ifdef USB_HS_MODE
    tmp_baseAddress                = 0x400C0000UL;
    pdev->basic_cfgs.core_type     = 1;   //HS
#ifdef USB_HS_EXTERNAL_PHY
    pdev->basic_cfgs.phy_type      = 1;
#endif
#endif  //USB_HS_MODE

    pdev->regs.GREGS = (USB_CORE_GREGS *)(tmp_baseAddress + 0);
    pdev->regs.DREGS = (USB_CORE_DREGS *)(tmp_baseAddress + 0x800);
    tmp_1 = 0;
    while(tmp_1 < pdev->basic_cfgs.dev_epnum)
    {
        pdev->regs.INEP_REGS[tmp_1]  = (USB_CORE_INEPREGS *)(tmp_baseAddress + 0x900 + (tmp_1 * 0x20));
        pdev->regs.OUTEP_REGS[tmp_1] = (USB_CORE_OUTEPREGS *)(tmp_baseAddress + 0xb00 + (tmp_1 * 0x20));
        tmp_1++;
    }
    tmp_1 = 0;
    while(tmp_1 < pdev->basic_cfgs.dev_epnum)
    {
        pdev->regs.DFIFO[tmp_1]      = (uint32_t *)(tmp_baseAddress + 0x1000 + (tmp_1 * 0x1000));
        tmp_1++;
    }
    pdev->regs.PCGCCTL = (uint32_t *)(tmp_baseAddress + 0xe00);
#ifdef USE_HOST_MODE     //if the application mode is host
    pdev->regs.HREGS = (USB_CORE_HREGS *)(tmp_baseAddress + 0x400);
    pdev->regs.HPRT0 = (uint32_t *)(tmp_baseAddress + 0x440);
    tmp_1 = 0;
    while(tmp_1 < pdev->basic_cfgs.host_chnum)
    {
        pdev->regs.HC_REGS[tmp_1] = (USB_CORE_HC_REGS *)(tmp_baseAddress + 0x500 + (tmp_1 * 0x20));
        tmp_1++;
    }
#endif  //USE_HOST_MODE
}

/**
 *******************************************************************************
 ** \brief  Initializes the USB controller registers and prepares the core
 **         device mode or host mode operation.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_initusbcore(usb_core_instance *pdev)
{
    __IO uint32_t  tmp_gusbcfg;
    __IO uint32_t  tmp_gahbcfg;

    tmp_gusbcfg  = 0;
    tmp_gahbcfg  = 0;
    // reset the core through core soft reset
    hd_usb_coresoftrst(pdev);
    if(pdev->basic_cfgs.phy_type == 1)
    {
        // select the speed mode
        tmp_gusbcfg  = HD_USB_RDREG32(&pdev->regs.GREGS->GUSBCFG);
        tmp_gusbcfg &= ~(1u<<6);  //HS Interface
        tmp_gusbcfg |= 1<<4;      //ULPI Interface
        HD_USB_WRREG32(&pdev->regs.GREGS->GUSBCFG, tmp_gusbcfg);
    }
    else
    {
        // select the speed mode
        tmp_gusbcfg  = HD_USB_RDREG32(&pdev->regs.GREGS->GUSBCFG);
        tmp_gusbcfg |= 1u<<6; //select the full-speed serial transceiver
        HD_USB_WRREG32(&pdev->regs.GREGS->GUSBCFG, tmp_gusbcfg);
        if(pdev->basic_cfgs.core_type == 1)
        {
            //enable the embedded PHY in USBHS mode
            M4_PERIC->USB_SYCTLREG |= PERIC_USB_SYCTLREG_USBHS_FSPHYE;
        }
    }
    // reset the core through core soft reset
    hd_usb_coresoftrst(pdev);
    hd_usb_mdelay(20ul);
    if(pdev->basic_cfgs.dmaen == 1u)
    {
        tmp_gahbcfg = HD_USB_RDREG32(&pdev->regs.GREGS->GAHBCFG);
        tmp_gahbcfg &= ~(0x0000003e);  //reset the DMAEn and HBstLen of register GAHBCFG
        tmp_gahbcfg |= 5u<<1;          //burst length/type(HBstLen) 64-words x32-bit
        tmp_gahbcfg |= 1u<<5;          //core operates in a DMA mode
        HD_USB_WRREG32(&pdev->regs.GREGS->GAHBCFG, tmp_gahbcfg);
    }
}

/**
 *******************************************************************************
 ** \brief  Flush a Tx FIFO whose index is num
 ** \param  pdev : device instance
 ** \param  num : txFIFO index
 ** \retval none
 ******************************************************************************/
void hd_usb_txfifoflush(usb_core_instance *pdev, uint32_t num)
{
    __IO uint32_t tmp_grstctl;
    __IO uint32_t tmp_1;

    tmp_1        = 0;
    tmp_grstctl  = 0ul;             //set the init value to be zero
    tmp_grstctl |= 1u<<5;           //set the TxFIFO Flush bit
    tmp_grstctl |= (num&0x1f)<<6;   //TxFIFO Number
    HD_USB_WRREG32(&pdev->regs.GREGS->GRSTCTL, tmp_grstctl);
    // wait for the finishing of txFIFO flushing
    do{
        tmp_grstctl = HD_USB_RDREG32(&pdev->regs.GREGS->GRSTCTL);
        if(tmp_1<=200000ul)
        {
            tmp_1++;
        }
        else
        {
            break;
        }
        hd_usb_udelay(1ul);
    }while(tmp_grstctl&(1u<<5));
    // Wait for at least 3 PHY clocks after the txfifo has been flushed
    hd_usb_udelay(3ul);
}

/**
 *******************************************************************************
 ** \brief  Flush the whole rxFIFO
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_rxfifoflush(usb_core_instance *pdev)
{
    __IO uint32_t tmp_grstctl;
    __IO uint32_t tmp_1;

    tmp_1        = 0;
    tmp_grstctl  = 0;
    tmp_grstctl |= 1ul<<4;      //set the RxFIFO Flush bit
    HD_USB_WRREG32(&pdev->regs.GREGS->GRSTCTL, tmp_grstctl);
    // wait for the finishing of rxFIFO flushing
    do{
        tmp_grstctl = HD_USB_RDREG32( &pdev->regs.GREGS->GRSTCTL);
        if(tmp_1<=200000ul)
        {
            tmp_1++;
        }
        else
        {
            break;
        }
        hd_usb_udelay(1ul);
    }while(tmp_grstctl & (1ul<<4));
    // Wait for at least 3 PHY clocks after the rxfifo has been flushed
    hd_usb_udelay(3ul);
}

/**
 *******************************************************************************
 ** \brief  set the core to be host mode or device mode through the second
 **         input parameter.
 ** \param  pdev : device instance
 ** \param  mode :  mode of HOST_MODE or DEVICE_MODE that the core would be
 ** \retval none
 ******************************************************************************/
void hd_usb_modeset(usb_core_instance *pdev, uint8_t mode)
{
    uint32_t  tmp_gusbcfg;

    tmp_gusbcfg  = HD_USB_RDREG32(&pdev->regs.GREGS->GUSBCFG);
    tmp_gusbcfg &= ~(3ul<<29);
    if ( mode == HOST_MODE)
    {
        tmp_gusbcfg |= 1ul<<29;
    }
    else
    {
        tmp_gusbcfg |= 2ul<<29;
    }
    HD_USB_WRREG32(&pdev->regs.GREGS->GUSBCFG, tmp_gusbcfg);
    // wate for the change to take effect
    hd_usb_mdelay(50ul);
}

/**
 *******************************************************************************
 ** \brief  initializes the initial status of all endpoints of the device to be
 **         disable.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_devepdis(usb_core_instance *pdev)
{
    __IO uint8_t tmp_1;
    USB_CORE_DEPCTL_TypeDef  depctl;

    tmp_1 = 0;
    while(tmp_1 < pdev->basic_cfgs.dev_epnum)
    {
        depctl.b = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(&pdev->regs.INEP_REGS[tmp_1]->DIEPCTL);
        if (depctl.b.epena)
        {
            *(uint32_t*)&depctl.b = 0ul;
            depctl.b.epdis        = 1u;
            depctl.b.snak         = 1u;
        }
        else
        {
            *(uint32_t*)&depctl.b = 0ul;
        }
        HD_USB_WRREG32( &pdev->regs.INEP_REGS[tmp_1]->DIEPCTL, *(uint32_t*)&depctl.b);
        HD_USB_WRREG32( &pdev->regs.INEP_REGS[tmp_1]->DIEPTSIZ, 0ul);
        HD_USB_WRREG32( &pdev->regs.INEP_REGS[tmp_1]->DIEPINT, 0xFFul);
        tmp_1++;
    }

    tmp_1 = 0;
    while(tmp_1 < pdev->basic_cfgs.dev_epnum)
    {
        depctl.b = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(&pdev->regs.OUTEP_REGS[tmp_1]->DOEPCTL);
        if (depctl.b.epena)
        {
            *(uint32_t*)&depctl.b = 0ul;
            depctl.b.epdis        = 1u;
            depctl.b.snak         = 1u;
        }
        else
        {
            *(uint32_t*)&depctl.b = 0ul;
        }
        HD_USB_WRREG32( &pdev->regs.OUTEP_REGS[tmp_1]->DOEPCTL, *(uint32_t*)&depctl.b);
        HD_USB_WRREG32( &pdev->regs.OUTEP_REGS[tmp_1]->DOEPTSIZ, 0ul);
        HD_USB_WRREG32( &pdev->regs.OUTEP_REGS[tmp_1]->DOEPINT, 0xFFul);
        tmp_1++;
    }
}

/**
 *******************************************************************************
 ** \brief  initializes the USB controller, include the size of txFIFO, rxFIFO
 **         status of endpoints, interrupt register etc. Details are shown as
 **         follows.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_devmodeinit(usb_core_instance *pdev)
{
    USB_CORE_DCFG_TypeDef    dcfg;
    USB_CORE_FSIZ_TypeDef    nptxfifosize;
    USB_CORE_FSIZ_TypeDef    txfifosize;

    dcfg.d32 = 0ul;
    *(uint32_t*)&nptxfifosize.b = 0ul;
    *(uint32_t*)&txfifosize.b   = 0ul;
    dcfg.d32 = HD_USB_RDREG32(&pdev->regs.DREGS->DCFG);
    dcfg.b.perfrint             = 0;
    dcfg.b.devspd               = 3;
    HD_USB_WRREG32(&pdev->regs.DREGS->DCFG, dcfg.d32 );

#ifdef USB_FS_MODE
    HD_USB_WRREG32(&pdev->regs.GREGS->GRXFSIZ, (uint32_t)RX_FIFO_FS_SIZE);

    /* set txFIFO and rxFIFO size of EP0 */
    nptxfifosize.b.depth        = (uint32_t)TX0_FIFO_FS_SIZE;
    nptxfifosize.b.startaddr    = (uint32_t)RX_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->GNPTXFSIZ, *(uint32_t*)&nptxfifosize.b);

    /* set txFIFO size of EP1 */
    txfifosize.b.startaddr      = nptxfifosize.b.startaddr + nptxfifosize.b.depth;
    txfifosize.b.depth = (uint32_t)TX1_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[0], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP2 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX2_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[1], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP3 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth = (uint32_t)TX3_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[2], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP4 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX4_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[3], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP5 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX5_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[4], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP6 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX6_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[5], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP7 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX7_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[6], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP8 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX8_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[7], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP9 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX9_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[8], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP10 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX10_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[9], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP11 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX11_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[10], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP12 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX12_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[11], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP13 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX13_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[12], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP14 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX14_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[13], *(uint32_t*)&txfifosize.b);
    /* set txFIFO size of EP15 */
    txfifosize.b.startaddr     += txfifosize.b.depth;
    txfifosize.b.depth          = (uint32_t)TX15_FIFO_FS_SIZE;
    HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[14], *(uint32_t*)&txfifosize.b);
#endif //USB_FS_MODE
#ifdef USB_HS_MODE
    if(pdev->basic_cfgs.core_type == 1)
    {
        if(pdev->basic_cfgs.phy_type == 1)      //external PHY
        {
            dcfg.d32 = HD_USB_RDREG32(&pdev->regs.DREGS->DCFG);
            dcfg.b.devspd               = 0;
            HD_USB_WRREG32(&pdev->regs.DREGS->DCFG, dcfg.d32);
        }
        else                                   //embedded PHY
        {
            dcfg.d32 = HD_USB_RDREG32( &pdev->regs.DREGS->DCFG);
            dcfg.b.devspd               = 1;
            HD_USB_WRREG32(&pdev->regs.DREGS->DCFG, dcfg.d32);
        }
        /* set txFIFO and rxFIFO size of EP0 */
        nptxfifosize.b.depth        = (uint32_t)TX0_FIFO_HS_SIZE;
        nptxfifosize.b.startaddr    = (uint32_t)RX_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->GNPTXFSIZ, *(uint32_t*)&nptxfifosize.b);

        /* set txFIFO size of EP1 */
        txfifosize.b.startaddr      = nptxfifosize.b.startaddr + nptxfifosize.b.depth;
        txfifosize.b.depth = (uint32_t)TX1_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[0], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP2 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX2_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[1], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP3 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX3_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[2], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP4 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX4_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[3], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP5 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX5_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[4], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP6 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX6_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[5], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP7 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX7_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[6], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP8 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX8_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[7], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP9 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX9_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[8], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP10 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX10_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[9], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP11 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX11_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[10], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP12 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX12_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[11], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP13 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX13_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[12], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP14 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX14_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[13], *(uint32_t*)&txfifosize.b );
        /* set txFIFO size of EP15 */
        txfifosize.b.startaddr      = txfifosize.b.startaddr;
        txfifosize.b.depth = (uint32_t)TX15_FIFO_HS_SIZE;
        HD_USB_WRREG32(&pdev->regs.GREGS->DPTXFSIZ[14], *(uint32_t*)&txfifosize.b );
    }
#endif //USB_HS_MODE

    hd_usb_clrandmskepint(pdev);
    hd_usb_devepdis(pdev);
    hd_usb_coreconn(pdev);
    hd_usb_devinten(pdev);
}

/**
 *******************************************************************************
 ** \brief  Enable the interrupt setting when in device mode.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_devinten(usb_core_instance *pdev)
{
    USB_CORE_GINTMSK_TypeDef  tmp_gintmsk;

