a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/BOOT/driver/src/hc32f4a0_usb_core_driver.c
    tmp_gintmsk.d32 = 0ul;
    HD_USB_WRREG32( &pdev->regs.GREGS->GINTMSK, 0ul);
    HD_USB_WRREG32( &pdev->regs.GREGS->GINTSTS, 0xBFFFFFFFul);
    /* Enable the normal interrupt setting */
    hd_usb_normalinten(pdev);
    if (pdev->basic_cfgs.dmaen == 0u)
    {
        tmp_gintmsk.b.rxstsqlvl = 1u;
    }
    /* Enable interrupts bits corresponding to the Device mode */
    tmp_gintmsk.b.usbsuspend       = 1u;
    tmp_gintmsk.b.usbreset         = 1u;
    tmp_gintmsk.b.enumdone         = 1u;
    tmp_gintmsk.b.inepintr         = 1u;
    tmp_gintmsk.b.outepintr        = 1u;
    tmp_gintmsk.b.sofintr          = 1u;
    tmp_gintmsk.b.incomplisoin     = 1u;
    tmp_gintmsk.b.incomplisoout    = 1u;
#ifdef VBUS_SENSING_ENABLED
    tmp_gintmsk.b.vbusvint         = 1u;
#endif
    HD_USB_MDFREG32( &pdev->regs.GREGS->GINTMSK, tmp_gintmsk.d32, tmp_gintmsk.d32);
}

/**
 *******************************************************************************
 ** \brief  get the working status of endpoint.
 ** \param  pdev : device instance
 ** \param  ep   : endpoint instance
 ** \retval current status of the endpoint
 ******************************************************************************/
uint32_t hd_usb_epstatusget(usb_core_instance *pdev ,USB_DEV_EP *ep)
{
    USB_CORE_DEPCTL_TypeDef  tmp_depctl;
    __IO uint32_t *tmp_depctl_addr;
    __IO uint32_t tmp_status = 0ul;

    *(uint32_t*)&tmp_depctl.b = 0ul;
    if (ep->ep_dir == 1u)
    {
        tmp_depctl_addr = &(pdev->regs.INEP_REGS[ep->epidx]->DIEPCTL);
        tmp_depctl.b    = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(tmp_depctl_addr);
        if(tmp_depctl.b.stall == 1u)
        {
            tmp_status  = USB_EP_TX_STALL;
        }
        else if(tmp_depctl.b.naksts == 1u)
        {
            tmp_status  = USB_EP_TX_NAK;
        }
        else
        {
            tmp_status  = USB_EP_TX_VALID;
        }
    }
    else
    {
        tmp_depctl_addr = &(pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL);
        tmp_depctl.b    = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(tmp_depctl_addr);
        if (tmp_depctl.b.stall == 1u)
        {
            tmp_status  = USB_EP_RX_STALL;
        }
        else if (tmp_depctl.b.naksts == 1u)
        {
            tmp_status  = USB_EP_RX_NAK;
        }
        else
        {
            tmp_status  = USB_EP_RX_VALID;
        }
    }

    return tmp_status;
}

/**
 *******************************************************************************
 ** \brief  set the working status of endpoint.
 ** \param  pdev : device instance
 ** \param  ep   : endpoint instance
 ** \param  Status : new Status that the endpoint would be
 ** \retval none
 ******************************************************************************/
void hd_usb_epstatusset(usb_core_instance *pdev, USB_DEV_EP *ep, uint32_t Status)
{
    USB_CORE_DEPCTL_TypeDef  tmp_depctl;
    __IO uint32_t *tmp_depctl_addr;

    uint8_t u8RetFlag                 = 0u;
    *(uint32_t*)&tmp_depctl.b         = 0ul;
    if (ep->ep_dir == 1u)
    {
        tmp_depctl_addr = &(pdev->regs.INEP_REGS[ep->epidx]->DIEPCTL);
        tmp_depctl.b    = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(tmp_depctl_addr);
        switch(Status)
        {
            case USB_EP_TX_STALL:
                hd_usb_setepstall(pdev, ep);
                u8RetFlag             = 1u;
            break;
            case USB_EP_TX_NAK:
                tmp_depctl.b.snak     = 1u;
            break;
            case USB_EP_TX_VALID:
                if (tmp_depctl.b.stall == 1u)
                {
                    ep->datax_pid     = 0u;
                    hd_usb_clearepstall(pdev, ep);
                    u8RetFlag         = 1u;
                }
                tmp_depctl.b.cnak     = 1u;
                tmp_depctl.b.usbactep = 1u;
                tmp_depctl.b.epena    = 1u;
            break;
            case USB_EP_TX_DIS:
                tmp_depctl.b.usbactep = 0u;
            break;
            default:
            break;
        }
    }
    else
    {
        tmp_depctl_addr = &(pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL);
        tmp_depctl.b = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(tmp_depctl_addr);
        switch(Status)
        {
            case USB_EP_RX_STALL:
                tmp_depctl.b.stall    = 1u;
            break;
            case USB_EP_RX_NAK:
                tmp_depctl.b.snak     = 1u;
            break;
            case USB_EP_RX_VALID:
                if (tmp_depctl.b.stall == 1u)
                {
                    ep->datax_pid     = 0u;
                    hd_usb_clearepstall(pdev, ep);
                    u8RetFlag         = 1u;
                }
                tmp_depctl.b.cnak     = 1u;
                tmp_depctl.b.usbactep = 1u;
                tmp_depctl.b.epena    = 1u;
            break;
            case USB_EP_RX_DIS:
                tmp_depctl.b.usbactep = 0u;
            break;
            default:
            break;
        }
    }
    if(1u != u8RetFlag)
    {
        HD_USB_WRREG32(tmp_depctl_addr, *(uint32_t*)&tmp_depctl.b);
    }
}

/**
 *******************************************************************************
 ** \brief  enable the EP0 to be actiove
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void  hd_usb_ep0activate(usb_core_instance *pdev)
{
    USB_CORE_DSTS_TypeDef    tmp_dsts;
    USB_CORE_DEPCTL_TypeDef  tmp_diepctl;
    USB_CORE_DCTL_TypeDef    tmp_dctl;

    tmp_dctl.d32 = 0ul;
    tmp_dsts.b = *(__IO stc_bUSB_CORE_DSTS_t*)&HD_USB_RDREG32(&pdev->regs.DREGS->DSTS);
    tmp_diepctl.d32 = HD_USB_RDREG32(&pdev->regs.INEP_REGS[0]->DIEPCTL);
    /* Set the MPS of the DIEPCTL0 based on the enumeration speed */
    if(tmp_dsts.b.enumspd == DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ \
        || tmp_dsts.b.enumspd == DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ\
        || tmp_dsts.b.enumspd == DSTS_ENUMSPD_FS_PHY_48MHZ)
    {
        tmp_diepctl.b.mps = 0;
    }
    else if(tmp_dsts.b.enumspd == DSTS_ENUMSPD_LS_PHY_6MHZ)
    {
        tmp_diepctl.b.mps = 3;
    }
    else
    {
        ;
    }
    HD_USB_WRREG32(&pdev->regs.INEP_REGS[0]->DIEPCTL, tmp_diepctl.d32);
    tmp_dctl.b.cgnpinnak = 1u;
    HD_USB_MDFREG32(&pdev->regs.DREGS->DCTL, tmp_dctl.d32, tmp_dctl.d32);
}


/**
 *******************************************************************************
 ** \brief  enable an EP to be active
 ** \param  pdev : device instance
 ** \param  ep   : endpoint instance
 ** \retval none
 ******************************************************************************/
void hd_usb_epactive(usb_core_instance *pdev, USB_DEV_EP *ep)
{
    USB_CORE_DEPCTL_TypeDef  tmp_depctl;
    USB_CORE_DAINT_TypeDef  tmp_daintmsk;
    __IO uint32_t *tmp_addr;

    *(uint32_t*)&tmp_depctl.b = 0ul;
    tmp_daintmsk.d32          = 0ul;
    if (ep->ep_dir == 1u)
    {
        tmp_addr              = &pdev->regs.INEP_REGS[ep->epidx]->DIEPCTL;
        tmp_daintmsk.ep.in    = (uint32_t)1 << ep->epidx;
    }
    else
    {
        tmp_addr              = &pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL;
        tmp_daintmsk.ep.out   = (uint32_t)1 << ep->epidx;
    }
    tmp_depctl.b = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(tmp_addr);
    if (!tmp_depctl.b.usbactep)
    {
        tmp_depctl.b.mps      = ep->maxpacket;
        tmp_depctl.b.eptype   = ep->trans_type;
        tmp_depctl.b.txfnum   = ep->tx_fifo_num;
        tmp_depctl.b.setd0pid = 1u;
        tmp_depctl.b.usbactep = 1u;
        HD_USB_WRREG32(tmp_addr, *(uint32_t*)&tmp_depctl.d32);
    }
    HD_USB_MDFREG32(&pdev->regs.DREGS->DAINTMSK, 0ul, tmp_daintmsk.d32);
}

/**
 *******************************************************************************
 ** \brief  enable an EP to be deactive state if it is active
 ** \param  pdev : device instance
 ** \param  ep   : endpoint instance
 ** \retval none
 ******************************************************************************/
void hd_usb_epdeactive(usb_core_instance *pdev, USB_DEV_EP *ep)
{
    __IO uint32_t  tmp_depctl;
    USB_CORE_DAINT_TypeDef  tmp_daintmsk;
    __IO uint32_t *addr;

    tmp_depctl       = 0ul;
    tmp_daintmsk.d32 = 0ul;
    if (ep->ep_dir == 1u)
    {
        addr                = &pdev->regs.INEP_REGS[ep->epidx]->DIEPCTL;
        tmp_daintmsk.ep.in  = (uint32_t)1 << ep->epidx;
    }
    else
    {
        addr                = &pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL;
        tmp_daintmsk.ep.out = (uint32_t)1 << ep->epidx;
    }
    tmp_depctl             &= ~(1ul<<15);
    HD_USB_WRREG32(addr, tmp_depctl);
    HD_USB_MDFREG32(&pdev->regs.DREGS->DAINTMSK, tmp_daintmsk.d32, 0ul);
}

/**
 *******************************************************************************
 ** \brief  Setup the data into the EP and begin to transmit data.
 ** \param  pdev : device instance
 ** \param  ep   : endpoint instance
 ** \retval none
 ******************************************************************************/
void hd_usb_epntransbegin(usb_core_instance *pdev, USB_DEV_EP *ep)
{
    USB_CORE_DEPCTL_TypeDef     depctl;
    USB_CORE_DEPXFRSIZ_TypeDef  deptsiz;
    USB_CORE_DSTS_TypeDef       dsts;
    uint32_t fifoemptymsk = 0ul;

    depctl.d32             = 0ul;
    *(uint32_t*)&deptsiz.b = 0ul;
    if (ep->ep_dir == 1u)
    {
        depctl.d32  = HD_USB_RDREG32(&(pdev->regs.INEP_REGS[ep->epidx]->DIEPCTL));
        deptsiz.b   = *(__IO stc_bUSB_CORE_DEPXFRSIZ_t*)&HD_USB_RDREG32(&(pdev->regs.INEP_REGS[ep->epidx]->DIEPTSIZ));
        /* Zero Length Packet? */
        if (ep->xfer_len == 0ul)
        {
            deptsiz.b.xfersize = 0u;
            deptsiz.b.pktcnt   = 1u;
        }
        else
        {
            /* Program the transfer size and packet count
            * as follows: xfersize = N * maxpacket +
            * short_packet pktcnt = N + (short_packet
            * exist ? 1 : 0)
            */
            deptsiz.b.xfersize = ep->xfer_len;
            deptsiz.b.pktcnt   = (ep->xfer_len - 1u + ep->maxpacket) / ep->maxpacket;

            if (ep->trans_type == EP_TYPE_ISOC)
            {
                deptsiz.b.mc = 1u;
            }
        }
        HD_USB_WRREG32(&pdev->regs.INEP_REGS[ep->epidx]->DIEPTSIZ, *(uint32_t*)&deptsiz.b);

        if (pdev->basic_cfgs.dmaen == 1u)
        {
            HD_USB_WRREG32(&pdev->regs.INEP_REGS[ep->epidx]->DIEPDMA, ep->dma_addr);
        }
        else
        {
            if (ep->trans_type != EP_TYPE_ISOC)
            {
                /* Enable the Tx FIFO Empty Interrupt for this EP */
                if (ep->xfer_len > 0u)
                {
                    fifoemptymsk = (uint32_t)1 << ep->epidx;
                    HD_USB_MDFREG32(&pdev->regs.DREGS->DIEPEMPMSK, 0ul, fifoemptymsk);
                }
            }
        }

        if (ep->trans_type == EP_TYPE_ISOC)
        {
            dsts.b = *(__IO stc_bUSB_CORE_DSTS_t*)&HD_USB_RDREG32(&pdev->regs.DREGS->DSTS);

