a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/BOOT/driver/src/hc32f4a0_usb_core_driver.c
            if (((dsts.b.soffn)&0x1u) == 0u)
            {
                depctl.b.setd1pid = 1u;
            }
            else
            {
                depctl.b.setd0pid = 1u;
            }
        }

        depctl.b.cnak  = 1u;
        depctl.b.epena = 1u;
        HD_USB_WRREG32(&pdev->regs.INEP_REGS[ep->epidx]->DIEPCTL, depctl.d32);

        if (ep->trans_type == EP_TYPE_ISOC)
        {
            hd_usb_wrpkt(pdev, ep->xfer_buff, ep->epidx, (uint16_t)ep->xfer_len);
        }
    }
    else
    {
        depctl.d32  = HD_USB_RDREG32(&(pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL));
        deptsiz.b = *(__IO stc_bUSB_CORE_DEPXFRSIZ_t*)&HD_USB_RDREG32(&(pdev->regs.OUTEP_REGS[ep->epidx]->DOEPTSIZ));
        /* Program the transfer size and packet count as follows:
        * pktcnt = N
        * xfersize = N * maxpacket
        */
        if (ep->xfer_len == 0u)
        {
            deptsiz.b.xfersize = ep->maxpacket;
            deptsiz.b.pktcnt   = 1u;
        }
        else
        {
            deptsiz.b.pktcnt   = (ep->xfer_len + (ep->maxpacket - 1u)) / ep->maxpacket;
            deptsiz.b.xfersize = deptsiz.b.pktcnt * ep->maxpacket;
            ep->xfer_len       = deptsiz.b.xfersize;
        }
        HD_USB_WRREG32(&pdev->regs.OUTEP_REGS[ep->epidx]->DOEPTSIZ, *(uint32_t*)&deptsiz.b);

        if (pdev->basic_cfgs.dmaen == 1u)
        {
            HD_USB_WRREG32(&pdev->regs.OUTEP_REGS[ep->epidx]->DOEPDMA, ep->dma_addr);
        }

        if (ep->trans_type == EP_TYPE_ISOC)
        {
            if (ep->datax_pid)
            {
                depctl.b.setd1pid = 1u;
            }
            else
            {
                depctl.b.setd0pid = 1u;
            }
        }
        depctl.b.cnak  = 1u;
        depctl.b.epena = 1u;
        HD_USB_WRREG32(&pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL, depctl.d32);
    }
}

/**
 *******************************************************************************
 ** \brief  Setup the data into the EP0 and begin to transmit data.
 ** \param  pdev : device instance
 ** \param  ep   : endpoint instance
 ** \retval none
 ******************************************************************************/
void hd_usb_ep0transbegin(usb_core_instance *pdev, USB_DEV_EP *ep)
{
    USB_CORE_DEPCTL_TypeDef      depctl;
    USB_CORE_DEP0XFRSIZ_TypeDef  deptsiz;
    USB_CORE_INEPREGS          *in_regs;
    uint32_t fifoemptymsk = 0ul;

    depctl.d32   = 0ul;
    deptsiz.d32  = 0ul;
    if (ep->ep_dir == 1u)
    {
        in_regs     = pdev->regs.INEP_REGS[0];
        depctl.d32  = HD_USB_RDREG32(&in_regs->DIEPCTL);
        deptsiz.d32 = HD_USB_RDREG32(&in_regs->DIEPTSIZ);
        /* Zero Length Packet? */
        if (ep->xfer_len == 0u)
        {
            deptsiz.b.xfersize = 0u;
            deptsiz.b.pktcnt   = 1u;
        }
        else
        {
            if (ep->xfer_len > ep->maxpacket)
            {
                ep->xfer_len       = ep->maxpacket;
                deptsiz.b.xfersize = ep->maxpacket;
            }
            else
            {
                deptsiz.b.xfersize = ep->xfer_len;
            }
            deptsiz.b.pktcnt       = 1u;
        }
        HD_USB_WRREG32(&in_regs->DIEPTSIZ, deptsiz.d32);

        if (pdev->basic_cfgs.dmaen == 1u)
        {
            HD_USB_WRREG32(&pdev->regs.INEP_REGS[ep->epidx]->DIEPDMA, ep->dma_addr);
        }

        depctl.b.cnak  = 1u;
        depctl.b.epena = 1u;
        HD_USB_WRREG32(&in_regs->DIEPCTL, depctl.d32);

        if (pdev->basic_cfgs.dmaen == 0u)
        {
            /* Enable the Tx FIFO Empty Interrupt for this EP */
            if (ep->xfer_len > 0u)
            {
                fifoemptymsk |= (uint32_t)1 << ep->epidx;
                HD_USB_MDFREG32(&pdev->regs.DREGS->DIEPEMPMSK, 0ul, fifoemptymsk);
            }
        }
    }
    else
    {
        depctl.d32  = HD_USB_RDREG32(&pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL);
        deptsiz.d32 = HD_USB_RDREG32(&pdev->regs.OUTEP_REGS[ep->epidx]->DOEPTSIZ);
        /* Program the transfer size and packet count as follows:
        * xfersize = N * (maxpacket + 4 - (maxpacket % 4))
        * pktcnt = N           */
        if (ep->xfer_len == 0u)
        {
            deptsiz.b.xfersize = 0u;
            deptsiz.b.pktcnt   = 1u;
        }
        else
        {
            ep->xfer_len       = __MIN(ep->rem_data_len, ep->maxpacket);
            deptsiz.b.xfersize = ep->xfer_len;
            deptsiz.b.pktcnt   = 1u;
        }
        HD_USB_WRREG32(&pdev->regs.OUTEP_REGS[ep->epidx]->DOEPTSIZ, deptsiz.d32);
        if (pdev->basic_cfgs.dmaen == 1u)
        {
            HD_USB_WRREG32(&pdev->regs.OUTEP_REGS[ep->epidx]->DOEPDMA, ep->dma_addr);
        }
        depctl.b.cnak  = 1u;
        depctl.b.epena = 1u;
        HD_USB_WRREG32 (&(pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL), depctl.d32);
    }
}

/**
 *******************************************************************************
 ** \brief  Set the EP to be stall status
 ** \param  pdev : device instance
 ** \param  ep   : endpoint instance
 ** \retval none
 ******************************************************************************/
void hd_usb_setepstall(usb_core_instance *pdev, USB_DEV_EP *ep)
{
    USB_CORE_DEPCTL_TypeDef  tmp_depctl;
    __IO uint32_t *tmp_depctl_addr;

    *(uint32_t*)&tmp_depctl.b = 0ul;
    if (ep->ep_dir == 1u)
    {
        tmp_depctl_addr = &(pdev->regs.INEP_REGS[ep->epidx]->DIEPCTL);
        tmp_depctl.b    = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(tmp_depctl_addr);
        if (tmp_depctl.b.epena)
        {
            tmp_depctl.b.epdis = 1u;
        }
        tmp_depctl.b.stall     = 1u;
        HD_USB_WRREG32(tmp_depctl_addr, *(uint32_t*)&tmp_depctl.b);
    }
    else
    {
        tmp_depctl_addr    = &(pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL);
        tmp_depctl.b       = *(__IO stc_bUSB_CORE_DEPCTL_t*)&HD_USB_RDREG32(tmp_depctl_addr);
        tmp_depctl.b.stall = 1u;
        HD_USB_WRREG32(tmp_depctl_addr, *(uint32_t*)&tmp_depctl.b);
    }
}

/**
 *******************************************************************************
 ** \brief  clear the stall status of a EP
 ** \param  pdev : device instance
 ** \param  ep   : endpoint instance
 ** \retval none
 ******************************************************************************/
void hd_usb_clearepstall(usb_core_instance *pdev, USB_DEV_EP *ep)
{
    USB_CORE_DEPCTL_TypeDef  tmp_depctl;
    __IO uint32_t *tmp_depctl_addr;

