a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/BOOT/driver/src/hc32f4a0_usb_core_driver.c
    tmp_depctl.d32 = 0ul;

    if (ep->ep_dir == 1u)
    {
        tmp_depctl_addr = &(pdev->regs.INEP_REGS[ep->epidx]->DIEPCTL);
    }
    else
    {
        tmp_depctl_addr = &(pdev->regs.OUTEP_REGS[ep->epidx]->DOEPCTL);
    }
    tmp_depctl.d32     = HD_USB_RDREG32(tmp_depctl_addr);
    tmp_depctl.b.stall = 0u;
    if ((ep->trans_type == EP_TYPE_INTR) || (ep->trans_type == EP_TYPE_BULK))
    {
        tmp_depctl.b.setd0pid = 1u;
    }
    HD_USB_WRREG32(tmp_depctl_addr, tmp_depctl.d32);
}

/**
 *******************************************************************************
 ** \brief  configure the EPO to receive data packets
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_ep0revcfg(usb_core_instance *pdev)
{
    USB_CORE_DEP0XFRSIZ_TypeDef  tmp_doeptsize0;
    USB_CORE_DEPCTL_TypeDef  tmp_doepctl;

    tmp_doeptsize0.d32                 = 0ul;
    tmp_doeptsize0.b.supcnt            = 3u;
    tmp_doeptsize0.b.pktcnt            = 1u;
    tmp_doeptsize0.b.xfersize          = 64u;
    pdev->dev.out_ep[0].xfer_len       = 64u;
    pdev->dev.out_ep[0].rem_data_len   = 64u;
    pdev->dev.out_ep[0].total_data_len = 64u;
    HD_USB_WRREG32(&pdev->regs.OUTEP_REGS[0]->DOEPTSIZ, tmp_doeptsize0.d32 );

    if (pdev->basic_cfgs.dmaen == 1u)
    {
        tmp_doepctl.d32     = 0ul;
        HD_USB_WRREG32(&pdev->regs.OUTEP_REGS[0]->DOEPDMA, (uint32_t)&pdev->dev.setup_pkt_buf);
        tmp_doepctl.d32     = HD_USB_RDREG32(&pdev->regs.OUTEP_REGS[0]->DOEPCTL);
        tmp_doepctl.b.epena = 1u;
        tmp_doepctl.d32     = 0x80008000ul;
        HD_USB_WRREG32(&pdev->regs.OUTEP_REGS[0]->DOEPCTL, tmp_doepctl.d32);
    }
}

/**
 *******************************************************************************
 ** \brief  enable remote wakeup active
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_remotewakeupen(usb_core_instance *pdev)
{
    USB_CORE_DCTL_TypeDef     dctl;
    USB_CORE_DSTS_TypeDef     dsts;
    USB_CORE_PCGCCTL_TypeDef  power;

    if (pdev->dev.device_remote_wakeup)
    {
        dsts.b = *(__IO stc_bUSB_CORE_DSTS_t*)&HD_USB_RDREG32(&pdev->regs.DREGS->DSTS);
        if(dsts.b.suspsts == 1u)
        {
            if(pdev->basic_cfgs.low_power)
            {
                /* un-gate USB Core clock */
                power.d32        = HD_USB_RDREG32(&pdev->regs.PCGCCTL);
                power.b.gatehclk = 0u;
                power.b.stoppclk = 0u;
                HD_USB_WRREG32(pdev->regs.PCGCCTL, power.d32);
            }
        }
    }
    dctl.d32          = 0ul;
    dctl.b.rmtwkupsig = 1u;
    HD_USB_MDFREG32(&pdev->regs.DREGS->DCTL, 0ul, dctl.d32);
    hd_usb_mdelay(5ul);
    HD_USB_MDFREG32(&pdev->regs.DREGS->DCTL, dctl.d32, 0ul );
}

/**
 *******************************************************************************
 ** \brief  control the device to connect or disconnect
 ** \param  pdev: device instance
 ** \param  link: 1(conn) or 0(disconn)
 ** \retval none
 ******************************************************************************/
void hd_usb_ctrldevconnect(usb_core_instance *pdev, uint8_t link)
{
    USB_CORE_DCTL_TypeDef  dctl;
    dctl.d32 = HD_USB_RDREG32(&pdev->regs.DREGS->DCTL);
    dctl.b.sftdiscon  = link;
    HD_USB_WRREG32(&pdev->regs.DREGS->DCTL, dctl.d32);
    hd_usb_mdelay(3ul);
}

#ifdef USE_HOST_MODE
/**
 *******************************************************************************
 ** \brief  Initializes the USB controller when it is host mode
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_hostmodeinit(usb_core_instance *pdev)
{
    __IO uint8_t tmp_1;
    /* configure charge pump IO */
    hd_usb_bsp_cfgvbus(pdev);
    hd_usb_vbusctrl(pdev, 1u);
    hd_usb_mdelay(50ul);

    HD_USB_WRREG32(pdev->regs.PCGCCTL, 0ul);  //reset the register-PCGCCTL
#ifdef USB_HS_EXTERNAL_PHY
    hd_usb_fslspclkselset(pdev , HCFG_30_60_MHZ); //PHY clock is running at 6MHz
#else
    hd_usb_fslspclkselset(pdev , HCFG_6_MHZ); //PHY clock is running at 6MHz
#endif
    hd_usb_hprtrst(pdev);                     //reset the port
    hd_usb_enumspeed(pdev);                   //FS or LS bases on the maximum speed supported by the connected device
    hd_usb_sethostfifo(pdev);
    /* Flush all the txFIFO and the whole rxFIFO */
    hd_usb_txfifoflush(pdev, 0x10ul);
    hd_usb_rxfifoflush(pdev);
    /* Clear all HC Interrupt bits that are pending */
    tmp_1 = 0;
    while(tmp_1 < pdev->basic_cfgs.host_chnum)
    {
        HD_USB_WRREG32( &pdev->regs.HC_REGS[tmp_1]->HCINT, 0xFFFFFFFFul );
        HD_USB_WRREG32( &pdev->regs.HC_REGS[tmp_1]->HCINTMSK, 0ul );
        tmp_1++;
    }
    hd_usb_hostinten(pdev);
}

/**
 *******************************************************************************
 ** \brief  set the vbus if state is 1 or reset the vbus if state is 0.
 ** \param  pdev : device instance
 ** \param  state : the vbus state it would be.
 ** \retval none
 ******************************************************************************/
void hd_usb_vbusctrl(usb_core_instance *pdev, uint8_t state)
{
    USB_CORE_HPRT_TypeDef     tmp_hprt;
    __IO uint32_t u32ReadHprtTemp = 0ul;
    *(uint32_t*)&tmp_hprt.b  = 0ul;
    /* enable or disable the external charge pump */
    hd_usb_bsp_drivevbus(pdev, state);
    u32ReadHprtTemp = hd_usb_rdhprt(pdev);
    tmp_hprt.b      = *(stc_bUSB_CORE_HPRT0_t*)&u32ReadHprtTemp;
    if ((tmp_hprt.b.prtpwr == 0u ) && (state == 1u ))
    {
        tmp_hprt.b.prtpwr = 1u;
        HD_USB_WRREG32(pdev->regs.HPRT0, *(uint32_t*)&tmp_hprt.b);
    }
    if ((tmp_hprt.b.prtpwr == 1u ) && (state == 0u ))
    {
        tmp_hprt.b.prtpwr = 0u;
        HD_USB_WRREG32(pdev->regs.HPRT0, *(uint32_t*)&tmp_hprt.b);
    }

