a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/BOOT/driver/src/hc32f4a0_usb_core_driver.c
}

/**
 *******************************************************************************
 ** \brief  Enables the related interrupts when the core is host mode
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_hostinten(usb_core_instance *pdev)
{
    USB_CORE_GINTMSK_TypeDef  intmsk;
    intmsk.d32 = 0ul;
    HD_USB_WRREG32(&pdev->regs.GREGS->GINTMSK, 0ul);

    /* Clear the pending interrupt bits */
    HD_USB_WRREG32(&pdev->regs.GREGS->GINTSTS, 0xFFFFFFFFul);

    /* Enable the normal interrupt bits */
    hd_usb_normalinten(pdev);

    if (pdev->basic_cfgs.dmaen == 0u)
    {
        intmsk.b.rxstsqlvl  = 1u;
    }
    intmsk.b.portintr   = 1u;
    intmsk.b.hcintr     = 1u;
    intmsk.b.disconnect = 1u;
    intmsk.b.sofintr    = 1u;
    intmsk.b.incomplisoout  = 1u;
    HD_USB_MDFREG32(&pdev->regs.GREGS->GINTMSK, intmsk.d32, intmsk.d32);
}

/**
 *******************************************************************************
 ** \brief  Reset the port, the 1'b0 state must last at lease 10ms.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_hprtrst(usb_core_instance *pdev)
{
    USB_CORE_HPRT_TypeDef  tmp_hprt;

    tmp_hprt.d32 = hd_usb_rdhprt(pdev);
    tmp_hprt.b.prtrst = 1u;
    HD_USB_WRREG32(pdev->regs.HPRT0, tmp_hprt.d32);
    hd_usb_mdelay (10ul);
    tmp_hprt.b.prtrst = 0u;
    HD_USB_WRREG32(pdev->regs.HPRT0, tmp_hprt.d32);
    hd_usb_mdelay (20ul);
}

/**
 *******************************************************************************
 ** \brief  Prepares transferring packets on a host channel
 ** \param  pdev : device instance
 ** \param  hc_num : channel index
 ** \retval status in byte
 ******************************************************************************/
uint8_t hd_usb_inithch(usb_core_instance *pdev, uint8_t hc_num)
{
    __IO uint8_t                status;
    uint32_t               intr_enable;
    USB_CORE_HCINTMSK_TypeDef   tmp_hcintmsk;
    USB_CORE_GINTMSK_TypeDef    tmp_gintmsk;
    USB_CORE_HCCHAR_TypeDef     tmp_hcchar;
    USB_CORE_HCINTn_TypeDef     tmp_hcint;

    status = HD_USB_OK;
    intr_enable      = 0ul;
    tmp_gintmsk.d32  = 0ul;
    tmp_hcintmsk.d32 = 0ul;
    tmp_hcchar.d32   = 0ul;
    tmp_hcint.d32    = 0xFFFFFFFFul;
    HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCINT, tmp_hcint.d32);
    /* Enable the channel interrupts required for this transferring */
    tmp_hcintmsk.d32 = 0ul;

    if (pdev->basic_cfgs.dmaen == 1u)
    {
        tmp_hcintmsk.b.ahberr = 1u;
    }

    switch (pdev->host.hc[hc_num].ep_type)
    {
        case EP_TYPE_CTRL:
        case EP_TYPE_BULK:
            tmp_hcintmsk.b.xfercompl   = 1u;
            tmp_hcintmsk.b.stall       = 1u;
            tmp_hcintmsk.b.xacterr     = 1u;
            tmp_hcintmsk.b.datatglerr  = 1u;
            tmp_hcintmsk.b.nak = 1u;
            if (pdev->host.hc[hc_num].is_epin)
            {
                tmp_hcintmsk.b.bblerr  = 1u;
            }
            else
            {
                tmp_hcintmsk.b.nyet    = 1u;
                if (pdev->host.hc[hc_num].do_ping)
                {
                    tmp_hcintmsk.b.ack = 1u;
                }
            }
            break;
        case EP_TYPE_INTR:
            tmp_hcintmsk.b.xfercompl   = 1u;
            tmp_hcintmsk.b.nak         = 1u;
            tmp_hcintmsk.b.stall       = 1u;
            tmp_hcintmsk.b.xacterr     = 1u;
            tmp_hcintmsk.b.datatglerr  = 1u;
            tmp_hcintmsk.b.frmovrun    = 1u;

            if (pdev->host.hc[hc_num].is_epin)
            {
                tmp_hcintmsk.b.bblerr  = 1u;
            }
            break;
        case EP_TYPE_ISOC:
            tmp_hcintmsk.b.xfercompl   = 1u;
            tmp_hcintmsk.b.frmovrun    = 1u;
            tmp_hcintmsk.b.ack         = 1u;

            if (pdev->host.hc[hc_num].is_epin)
            {
                tmp_hcintmsk.b.xacterr = 1u;
                tmp_hcintmsk.b.bblerr  = 1u;
            }
            break;
    }

    HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCINTMSK, tmp_hcintmsk.d32);

    intr_enable = ((uint32_t)1 )<< hc_num;
    HD_USB_MDFREG32(&pdev->regs.HREGS->HAINTMSK, 0ul, intr_enable);

    /* enable the host channel interrupts */
    tmp_gintmsk.b.hcintr = 1ul;
    HD_USB_MDFREG32(&pdev->regs.GREGS->GINTMSK, 0ul, tmp_gintmsk.d32);

    /* modify HCCHAR */
    tmp_hcchar.d32 = 0ul;
    tmp_hcchar.b.devaddr = pdev->host.hc[hc_num].dev_addr;
    tmp_hcchar.b.epnum   = pdev->host.hc[hc_num].ep_idx;
    tmp_hcchar.b.epdir   = pdev->host.hc[hc_num].is_epin;
    tmp_hcchar.b.lspddev = (pdev->host.hc[hc_num].ch_speed == PRTSPD_LOW_SPEED);
    tmp_hcchar.b.eptype  = pdev->host.hc[hc_num].ep_type;
    tmp_hcchar.b.mps     = pdev->host.hc[hc_num].max_packet;
    if (pdev->host.hc[hc_num].ep_type == INT_TRANSFER)
    {
        tmp_hcchar.b.oddfrm  = 1u;
    }
    HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR, tmp_hcchar.d32);
    return status;
}

/**
 *******************************************************************************
 ** \brief  Start transfer on the channel whose index is hc_num.
 ** \param  pdev : device instance
 ** \param  hc_num : channel index
 ** \retval status in 8 bits
 ******************************************************************************/
uint8_t hd_usb_hchtransbegin(usb_core_instance *pdev, uint8_t hc_num)
{
    __IO uint8_t status = HD_USB_OK;
    USB_CORE_HCCHAR_TypeDef   tmp_hcchar;
    USB_CORE_HCTSIZn_TypeDef  tmp_hctsiz;
    USB_CORE_HNPTXSTS_TypeDef tmp_hnptxsts;
    USB_CORE_HPTXSTS_TypeDef  tmp_hptxsts;
    USB_CORE_GINTMSK_TypeDef  tmp_gintmsk;
    uint16_t                 len_words = 0u;

    uint16_t num_packets;
    uint16_t max_hc_pkt_count;

