a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/BOOT/driver/src/hc32f4a0_usb_core_driver.c
    max_hc_pkt_count = 256u;
    tmp_hctsiz.d32 = 0ul;
    tmp_hcchar.d32 = 0ul;
    tmp_gintmsk.d32 = 0ul;

    /* Compute the expected number of packets associated to the transfer */
    if (pdev->host.hc[hc_num].xfer_len > 0u)
    {
        num_packets = (uint16_t)((pdev->host.hc[hc_num].xfer_len + \
        (uint32_t)pdev->host.hc[hc_num].max_packet - 1ul) / (uint32_t)pdev->host.hc[hc_num].max_packet);

        if (num_packets > max_hc_pkt_count)
        {
            num_packets                    = max_hc_pkt_count;
            pdev->host.hc[hc_num].xfer_len = (uint32_t)num_packets * \
            (uint32_t)pdev->host.hc[hc_num].max_packet;
        }
    }
    else
    {
        num_packets = 1u;
    }
    if (pdev->host.hc[hc_num].is_epin)
    {
        pdev->host.hc[hc_num].xfer_len = (uint32_t)num_packets * \
        (uint32_t)pdev->host.hc[hc_num].max_packet;
    }

    tmp_hctsiz.b.xfersize = pdev->host.hc[hc_num].xfer_len;
    tmp_hctsiz.b.pktcnt   = num_packets;
    tmp_hctsiz.b.pid = pdev->host.hc[hc_num].pid_type;
    HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCTSIZ, tmp_hctsiz.d32);

    if (pdev->basic_cfgs.dmaen == 1u)
    {
        HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCDMA, (unsigned int)pdev->host.hc[hc_num].xfer_buff);
    }

    tmp_hcchar.d32 = HD_USB_RDREG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR);
    tmp_hcchar.b.oddfrm = hd_usb_ifevenframe(pdev);

    /* enable this host channel whose number is hc_num */
    tmp_hcchar.b.chen  = 1u;
    tmp_hcchar.b.chdis = 0u;
    HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR, tmp_hcchar.d32);

    if (pdev->basic_cfgs.dmaen == 0u)
    {
        if((pdev->host.hc[hc_num].is_epin == 0u) && (pdev->host.hc[hc_num].xfer_len > 0u))
        {
            switch(pdev->host.hc[hc_num].ep_type)
            {
                /* Non-periodic transmit */
                case EP_TYPE_CTRL:
                case EP_TYPE_BULK:
                    tmp_hnptxsts.b = *(__IO stc_bUSB_CORE_HNPTXSTS_t*)&HD_USB_RDREG32(&pdev->regs.GREGS->GNPTXSTS);  /* C-STAT */
                    len_words = (uint16_t)((pdev->host.hc[hc_num].xfer_len + 3ul) / 4ul);
                    /* check if the amount of free space available in the non-periodic txFIFO is enough */
                    if(len_words > tmp_hnptxsts.b.nptxfspcavail)
                    {
                        /* enable interrrupt of nptxfempty of GINTMSK*/
                        tmp_gintmsk.b.nptxfempty = 1u;
                        HD_USB_MDFREG32( &pdev->regs.GREGS->GINTMSK, 0ul, tmp_gintmsk.d32);
                    }
                    break;
                /* Periodic trnsmit */
                case EP_TYPE_INTR:
                case EP_TYPE_ISOC:
                    tmp_hptxsts.b = *(__IO stc_bUSB_CORE_HPTXSTS_t*)&HD_USB_RDREG32(&pdev->regs.HREGS->HPTXSTS);   /* C-STAT */
                    len_words = (uint16_t)((pdev->host.hc[hc_num].xfer_len + 3ul) / 4ul);
                    /* check if the space of periodic TxFIFO is enough */
                    if(len_words > tmp_hptxsts.b.ptxfspcavail) /* split the transfer */
                    {
                        /* enable interrrupt of ptxfempty of GINTMSK */
                        tmp_gintmsk.b.ptxfempty = 1u;
                        HD_USB_MDFREG32( &pdev->regs.GREGS->GINTMSK, 0ul, tmp_gintmsk.d32);
                    }
                    break;
                default:
                    break;
            }

            hd_usb_wrpkt(pdev, pdev->host.hc[hc_num].xfer_buff , hc_num, (uint16_t)pdev->host.hc[hc_num].xfer_len);
        }
    }
    return status;
}

/**
 *******************************************************************************
 ** \brief  Stop the host and flush all the txFIFOs and the whole rxFIFO.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
void hd_usb_hoststop(usb_core_instance *pdev)
{
    __IO uint32_t   tmp_1 = 0;

    HD_USB_WRREG32(&pdev->regs.HREGS->HAINTMSK , 0ul);
    HD_USB_WRREG32(&pdev->regs.HREGS->HAINT, 0xFFFFFFFFul);

    do{
        hd_usb_chrst(pdev, tmp_1);
        tmp_1++;
    }while(tmp_1 < pdev->basic_cfgs.host_chnum);
    /* flush all the txFIFOs and the whole rxFIFO */
    hd_usb_rxfifoflush(pdev);
    hd_usb_txfifoflush(pdev, 0x10ul);
}

/**
 *******************************************************************************
 ** \brief  make the channel to halt
 ** \param  pdev : device instance
 ** \param  hc_num : channel index
 ** \retval none
 ******************************************************************************/
void hd_usb_hchstop(usb_core_instance *pdev, uint8_t hc_num)
{
    USB_CORE_HNPTXSTS_TypeDef            tmp_nptxsts;
    USB_CORE_HPTXSTS_TypeDef             tmp_hptxsts;
    USB_CORE_HCCHAR_TypeDef              tmp_hcchar;

    *(uint32_t*)&tmp_nptxsts.b = 0ul;
    *(uint32_t*)&tmp_hptxsts.b = 0ul;
    tmp_hcchar.b       = *(__IO stc_bUSB_CORE_HCCHAR_t*)&HD_USB_RDREG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR);
    tmp_hcchar.b.chen  = 1u;
    tmp_hcchar.b.chdis = 1u;
    /* Check for space in the request queue to issue the halt. */
    if ((tmp_hcchar.b.eptype == CTRL_TRANSFER) || (tmp_hcchar.b.eptype == BULK_TRANSFER))
    {
        tmp_nptxsts.b = *(__IO stc_bUSB_CORE_HNPTXSTS_t*)&HD_USB_RDREG32(&pdev->regs.GREGS->GNPTXSTS);
        if (tmp_nptxsts.b.nptxqspcavail == 0u)
        {
            tmp_hcchar.b.chen = 0u;
        }
    }
    else
    {
        tmp_hptxsts.b = *(__IO stc_bUSB_CORE_HPTXSTS_t*)&HD_USB_RDREG32(&pdev->regs.HREGS->HPTXSTS);
        if (tmp_hptxsts.b.ptxqspcavail == 0u)
        {
            tmp_hcchar.b.chen = 0u;
        }
    }
    HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR, *(uint32_t*)&tmp_hcchar.b);
}

#endif

/*******************************************************************************
 * EOF
 ******************************************************************************/
